# DATA MISSING
In some cases in a dataset, we may see that some instances have incomplete or empty feature values.
These data errors can generate a faulty result if pushed into the machine learning model.
We can either remove or resolve these kinds of errors

In [14]:
import pandas as pd
school = pd.read_excel("data/students.xlsx")
school
# As we can see, the "Minor" and "Age" values for multiple instances are empty

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,ACMS,NaN,NaN,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,NaN,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,ACMS,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0
19,9941,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0

In [15]:
# We can filter out the instances for a specific column (Minor), which has a null value using the pandas "isnull" method
null_instance = school["Minor"].isnull()
null_instance
# We see that the instance number followed by a boolean value
# True means empty, False indicates non-null values

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9     False
10     True
11     True
12    False
13     True
14    False
15    False
16    False
17    False
18    False
19     True
Name: Minor, dtype: bool

In [16]:
# Using the "null_instance" filter we created above, we can now make a dataframe out of all the instances having a null value at the "cabin" column
school[null_instance]

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
10,5336,Homer,White,Finance,NaN,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,NaN,Dallas,TX,75201.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
19,9941,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0

**Removing missing values**
The missing values we have found can be removed using the pandas **dropna** method

In [17]:
school.dropna()
# From the result, we can see that all instances containing missing values have been removed

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0

In the above method we see that every instance with a missing value gets cleared
We can set the **subset** and **how** parameter in dropna method to get desired result
We need to provide the column names we want to filter out in the subset. We can provide multiple column names in a list
The how parameter takes 2 inputs:
    - **all**: The instance wil only be dropped if all the values are missing
    - **any**: The instance wil only be dropped if any of the values are missing

In [18]:
clean_school = school.dropna(subset=["Age", "State"], how="all")
clean_school
# We see that all instances having a null value in the "Age" and "State" features got dropped

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,ACMS,NaN,NaN,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,NaN,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,ACMS,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0
19,9941,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0

In [19]:
# We can also remove the feature column with missing data instead of instances
# For this, we can set the "axis" parameter of the "dropna" method to 1
school.dropna(axis=1)
# We can see that all columns that had a missing value has been removed

      ID  FirstName    LastName                Major
0   1869       Hana      Barton              Finance
1   2010     Alicia      Kanuri           Management
2   2075      Becca     Swanson            Marketing
3   2228     Halima       Aminu   Business Analytics
4   2442      Holly    Robinson              Finance
5   2858      Carla     Harding          Accountancy
6   3459       Alex     Swanson          Accountancy
7   3585     Aminah       Zalim            Marketing
8   5170        Gus  Cunningham              Finance
9   5317     Rafael       Solis   Business Analytics
10  5336      Homer       White              Finance
11  5495       Lara       Woods          Accountancy
12  6453       Otis     Johnson           Management
13  6504  Chantelle       Woods  Business Technology
14  6768   Caroline       Marsh   Business Analytics
15  7511      Laila     Carroll            Marketing
16  7965      Rocco      Decola              Finance
17  9232      Julie      Holmes  Business Technology
18  9268     Albert      Palmer           Management
19  9941       Zoya       Doyle   Business Analytics

In [21]:
# Instead of removing all features, we can remove the features containing only a fixed amount of NULL values
# We can provide the threshold value to a certain limit. If we want to remove a feature set with more than 50% of values missing, we have to pass the "50% of total number of instances" value to the "thresg" parameter
clean_school = school.dropna(axis=1, thresh=10)
clean_school
# As we can see, the "Minor" feature has been dropped as it has missing values for more than 50% of the instances

,ID,FirstName,LastName,Major,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,NaN,NaN,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,21.0,Male,Detroit,MI,48201.0
19,9941,Zoya,Doyle,Business Analytics,NaN,Female,Chicago,IL,60608.0

**Replacing missing values**
We can replace missing values instead of dropping them using the **fillna** method

In [24]:
# We can replace empty instance values by passing them as a dict in the fillna method
total_school = school.fillna({"Gender":"Rather not disclose"})
total_school
# We have replaced all missing values under the "Gender" feature with "Rather not disclose"

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,Rather not disclose,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,ACMS,NaN,Rather not disclose,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,Rather not disclose,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,ACMS,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0
19,9941,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0

In [25]:
# Instead of hard-coding replacement values, we can also replace them with a function
# For example, we can replace the empty values under the "Age" feature with the median of the age of the students
# <dataset>.fillna({"<feature>":<dataset>["<feature>"].median()})
total_school = school.fillna({"Age":school["Age"].median()})
total_school
# We see that the missing values in the age instance have been replaced by the median of the non-null values under "Age"

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,20.5,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,20.5,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,ACMS,20.5,NaN,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,20.5,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,20.5,NaN,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,ACMS,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0
19,9941,Zoya,Doyle,Business Analytics,NaN,20.5,Female,Chicago,IL,60608.0

In [29]:
# We can locate specific instances according to their value under an instance. Multiple values can be separated by the "&" operator
# (<dataset>["<instance_name>"] == "<instance_value>") & (school["<instance_name>"] == "<instance_value>")
filter_instance = (school["Gender"] == "Female") & (school["State"] == "IL")
# We can use the "loc" method to locate the intance as per the set filter as follows
school.loc[filter_instance, :]

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
2,2075,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
19,9941,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0

In [31]:
# We can change the value of an instance over th filtered data
#
school.loc[filter_instance, "ID"] = 9999
school
# Here we see that the values under the "ID" parameter for the filtered instances got replaced by 9999

,ID,FirstName,LastName,Major,Minor,Age,Gender,City,State,Zip
0,1869,Hana,Barton,Finance,NaN,22.0,Female,NaN,NaN,NaN
1,2010,Alicia,Kanuri,Management,NaN,21.0,Female,Berrien Springs,NaN,NaN
2,9999,Becca,Swanson,Marketing,NaN,22.0,Female,Chicago,IL,60608.0
3,2228,Halima,Aminu,Business Analytics,NaN,20.0,Female,Atlanta,GA,30303.0
4,2442,Holly,Robinson,Finance,NaN,20.0,Female,Charlotte,NC,28202.0
5,2858,Carla,Harding,Accountancy,NaN,NaN,Female,Youngstown,OH,44502.0
6,3459,Alex,Swanson,Accountancy,NaN,NaN,NaN,Granger,IN,NaN
7,3585,Aminah,Zalim,Marketing,NaN,20.0,Female,Ashburn,VA,20147.0
8,5170,Gus,Cunningham,Finance,Innovation,21.0,Male,Massillon,OH,44646.0
9,5317,Rafael,Solis,Business Analytics,ACMS,NaN,NaN,South Bend,IN,46601.0
10,5336,Homer,White,Finance,NaN,NaN,Male,St. Paul,MN,55101.0
11,5495,Lara,Woods,Accountancy,NaN,NaN,NaN,Dallas,TX,75201.0
12,6453,Otis,Johnson,Management,Political Science,19.0,Male,Anchorage,AK,99501.0
13,6504,Chantelle,Woods,Business Technology,NaN,18.0,Female,Chicago,NaN,60608.0
14,6768,Caroline,Marsh,Business Analytics,ACMS,22.0,Female,Niles,MI,NaN
15,7511,Laila,Carroll,Marketing,Innovation,20.0,Female,New York,NY,10001.0
16,7965,Rocco,Decola,Finance,Innovation,21.0,Male,Oakland,CA,94603.0
17,9232,Julie,Holmes,Business Technology,Innovation,18.0,Female,Webster,NY,14580.0
18,9268,Albert,Palmer,Management,Real Estate,21.0,Male,Detroit,MI,48201.0
19,9999,Zoya,Doyle,Business Analytics,NaN,NaN,Female,Chicago,IL,60608.0